		IDENTIFICATION DIVISION. PROGRAM-ID. P. DATA DIVISION.
		WORKING-STORAGE SECTION. 77 a PIC 9(11) VALUE 1. 77 b PIC 9(11).
		77 c PIC 9(11). 77 d PIC 9(11). 77 e PIC 9(11). 77 r PIC 9(11).
		77 t PIC 9(11). 77 i PIC 9(4). PROCEDURE DIVISION. M SECTION. IF
		i=100 THEN STOP RUN. ADD a TO r. IF r<10 DISPLAY r(11:1)ELSE IF r
		<100 DISPLAY r(10:2)ELSE IF r<1000 DISPLAY r(9:3)ELSE IF r<10000
		DISPLAY r(8:4)ELSE IF r<100000 DISPLAY r(7:5)ELSE IF r<1000000
		DISPLAY r(6:6)ELSE IF r<10000000 DISPLAY r(5:7)ELSE IF r<
		100000000 DISPLAY r(4:8)ELSE IF r<1000000000 DISPLAY r(3:9)ELSE
		IF r<10000000000 DISPLAY r(2:10)ELSE DISPLAY r. MOVE e TO t. MOVE
		d TO e. MOVE c TO d. MOVE b TO c. MOVE a TO b. ADD t TO b. MOVE t
		TO a. ADD e TO a. ADD 1 TO i. GO TO M.
